---
title: NavisworksExportOptions
classe: Autodesk.Revit.DB.NavisworksExportOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 20
---

# NavisworksExportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean ConvertElementProperties { get; set; }` | `navisworksExportOptions.ConvertElementProperties` | Boolean |
| `Boolean ConvertLights { get; set; }` | `navisworksExportOptions.ConvertLights` | Boolean |
| `Boolean ConvertLinkedCADFormats { get; set; }` | `navisworksExportOptions.ConvertLinkedCADFormats` | Boolean |
| `NavisworksCoordinates Coordinates { get; set; }` | `navisworksExportOptions.Coordinates` | NavisworksCoordinates |
| `Boolean DivideFileIntoLevels { get; set; }` | `navisworksExportOptions.DivideFileIntoLevels` | Boolean |
| `Boolean ExportElementIds { get; set; }` | `navisworksExportOptions.ExportElementIds` | Boolean |
| `Boolean ExportLinks { get; set; }` | `navisworksExportOptions.ExportLinks` | Boolean |
| `Boolean ExportParts { get; set; }` | `navisworksExportOptions.ExportParts` | Boolean |
| `Boolean ExportRoomAsAttribute { get; set; }` | `navisworksExportOptions.ExportRoomAsAttribute` | Boolean |
| `Boolean ExportRoomGeometry { get; set; }` | `navisworksExportOptions.ExportRoomGeometry` | Boolean |
| `NavisworksExportScope ExportScope { get; set; }` | `navisworksExportOptions.ExportScope` | NavisworksExportScope |
| `Boolean ExportUrls { get; set; }` | `navisworksExportOptions.ExportUrls` | Boolean |
| `Double FacetingFactor { get; set; }` | `navisworksExportOptions.FacetingFactor` | Double |
| `Boolean FindMissingMaterials { get; set; }` | `navisworksExportOptions.FindMissingMaterials` | Boolean |
| `Boolean IsValidObject { get; }` | `navisworksExportOptions.IsValidObject` | Boolean |
| `NavisworksParameters Parameters { get; set; }` | `navisworksExportOptions.Parameters` | NavisworksParameters |
| `ElementId ViewId { get; set; }` | `navisworksExportOptions.ViewId` | ElementId |
| `Void Dispose()` | `navisworksExportOptions.Dispose()` | Void |
| `ICollection<ElementId> GetSelectedElementIds()` | `navisworksExportOptions.GetSelectedElementIds()` | ICollection<ElementId> |
| `Void SetSelectedElementIds(ICollection<ElementId>)` | `navisworksExportOptions.SetSelectedElementIds(ids)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```